IDEA StatiCa Open Model
LineSupport.TypeEdgePosition Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 edge position type
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public TypeEdgePosition TypeEdgePosition { get; set; }
Public Property TypeEdgePosition As TypeEdgePosition
	Get
	Set
public:
property TypeEdgePosition TypeEdgePosition {
	TypeEdgePosition get ();
	void set (TypeEdgePosition value);
}
Property Value
Type: TypeEdgePosition
See Also
Reference
LineSupport Class
IdeaRS.OpenModel.Detail Namespace